## Installation Of Pandas
<li>Go to your terminal, open and activate your virtual environment and then use the following commands for installing pandas.</li>

<code>
    pip install pandas
</code>

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\srval\.conda\envs\venv\lib\site-packages (1.5.2)

WARNING: There was an error checking the latest version of pip.

Requirement already satisfied: numpy>=1.20.3 in c:\users\srval\.conda\envs\venv\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\srval\.conda\envs\venv\lib\site-packages (from pandas) (2022.6)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\srval\.conda\envs\venv\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\srval\.conda\envs\venv\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

## Importing Pandas
<li>We need to import pandas if we want to create a pandas dataframe and perform any analysis on them.</li>
<li>We can import pandas package using the following command:</li>
<code>
    import pandas as pd
</code>

In [1]:
import pandas as pd

### How To Load Pandas Dataframe From Csv files

<li>We can load a csv file and create a dataframe out of the data present inside a csv file using pandas.</li>
<li>We have <b>.read_csv()</b> method to read a csv file and create a pandas dataframe from the dataset.</li>

In [2]:
df = pd.read_csv('car_details.csv')

In [4]:
df.shape

(4340, 8)

In [6]:
weather_df = pd.read_csv('weather_data.csv',skiprows=2)

In [8]:
weather_df.shape

(13, 4)

#### Write a pandas dataframe to a csv file
<li>We can write a pandas dataframe to a csv file using .to_csv() method.</li>
<li>You can specify any name to the csv file while writing a pandas dataframe into a csv file.</li>

In [12]:
top_5_weather_df = weather_df.head()

In [15]:
top_5_weather_df.to_csv('top5_weather.csv', index=False)

#### Using head() and tail() method to see top 5 and last 5 rows
<li>To view the first few rows of our dataframe, we can use the DataFrame.head() method.</li>
<li>By default, it returns the first five rows of our dataframe.</li>
<li>However, it also accepts an optional integer parameter, which specifies the number of rows.</li>

<li>Similarly, to view the last few rows of our dataframe, we can use the DataFrame.tail() method.</li>
<li>By default, it returns the last five rows of our dataframe.</li>
<li>However, it also accepts an optional integer parameter, which specifies the number of rows.</li>

In [19]:
df.head(10)

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner
5,Maruti Alto LX BSIII,2007,140000,125000,Petrol,Individual,Manual,First Owner
6,Hyundai Xcent 1.2 Kappa S,2016,550000,25000,Petrol,Individual,Manual,First Owner
7,Tata Indigo Grand Petrol,2014,240000,60000,Petrol,Individual,Manual,Second Owner
8,Hyundai Creta 1.6 VTVT S,2015,850000,25000,Petrol,Individual,Manual,First Owner
9,Maruti Celerio Green VXI,2017,365000,78000,CNG,Individual,Manual,First Owner

In [21]:
df.tail(10)

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
4330,Tata Indica Vista Aqua 1.4 TDI,2010,150000,130000,Diesel,Individual,Manual,Second Owner
4331,Ford EcoSport 1.5 TDCi Titanium BSIV,2015,530000,175000,Diesel,Individual,Manual,Third Owner
4332,Mahindra Scorpio S2 7 Seater,2015,750000,120000,Diesel,Individual,Manual,First Owner
4333,Maruti Ritz VDi,2012,225000,90000,Diesel,Individual,Manual,Second Owner
4334,Toyota Innova 2.5 VX (Diesel) 8 Seater BS IV,2012,600000,170000,Diesel,Individual,Manual,First Owner
4335,Hyundai i20 Magna 1.4 CRDi (Diesel),2014,409999,80000,Diesel,Individual,Manual,Second Owner
4336,Hyundai i20 Magna 1.4 CRDi,2014,409999,80000,Diesel,Individual,Manual,Second Owner
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual,Second Owner
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual,First Owner
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual,First Owner

#### Finding the column names from the dataframe
<li>We have df.columns attributes to check the name of columns in the pandas dataframe.</li>
<li>Similarly, we have df.values attributes to check the data present in the pandas dataframe.</li>

In [22]:
df.columns

Index(['name', 'year', 'selling_price', 'km_driven', 'fuel', 'seller_type',
       'transmission', 'owner'],
      dtype='object')

In [23]:
df.values

array([['Maruti 800 AC', 2007, 60000, ..., 'Individual', 'Manual',
        'First Owner'],
       ['Maruti Wagon R LXI Minor', 2007, 135000, ..., 'Individual',
        'Manual', 'First Owner'],
       ['Hyundai Verna 1.6 SX', 2012, 600000, ..., 'Individual',
        'Manual', 'First Owner'],
       ...,
       ['Maruti 800 AC BSIII', 2009, 110000, ..., 'Individual', 'Manual',
        'Second Owner'],
       ['Hyundai Creta 1.6 CRDi SX Option', 2016, 865000, ...,
        'Individual', 'Manual', 'First Owner'],
       ['Renault KWID RXT', 2016, 225000, ..., 'Individual', 'Manual',
        'First Owner']], dtype=object)

#### Datatypes Information
<li>We can get the shape of the dataset using <b>.shape attribute.</li>
<li><b>.shape</b> attrib ute returns the tuple datatype containing the number of rows and number of columns in the dataset.</li>
<li>If we wanted an overview of all the dtypes used in our dataframe, we can use <b>.info()</b> method.</li>
<li>Note that <b>DataFrame.info()</b> prints the information, rather than returning it, so we can't assign it to a variable.</li>

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4340 entries, 0 to 4339
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           4340 non-null   object
 1   year           4340 non-null   int64
 2   selling_price  4340 non-null   int64
 3   km_driven      4340 non-null   int64
 4   fuel           4340 non-null   object
 5   seller_type    4340 non-null   object
 6   transmission   4340 non-null   object
 7   owner          4340 non-null   object
dtypes: int64(3), object(5)
memory usage: 271.4+ KB

#### Checking the type of your dataframe 
<li>Another feature that makes pandas better for working with data is that dataframes can contain more than one data type.</li>
<li>Axis values can have string labels, not just numeric ones.</li>
<li>Dataframes can contain columns with multiple data types: including integer, float, and string.</li>
<li>We can use the DataFrame.dtypes attribute (similar to NumPy) to return information about the types of each column.</li>
<li>When we import data, pandas attempts to guess the correct dtype for each column.</li>
<li>Generally, pandas does well with this, which means we don't need to worry about specifying dtypes every time we start to work with data.</li>

In [25]:
df.dtypes

name             object
year              int64
selling_price     int64
km_driven         int64
fuel             object
seller_type      object
transmission     object
owner            object
dtype: object

#### Checking the null values in the pandas dataframe

In [27]:
df.isnull().sum()

name             0
year             0
selling_price    0
km_driven        0
fuel             0
seller_type      0
transmission     0
owner            0
dtype: int64

In [28]:
weather_data_nan_df = pd.read_csv('weather_data_nan.csv')
weather_data_nan_df.head()

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/4/2017          NaN        9.0  Sunny
2  1/5/2017         -1.0        NaN   Snow
3  1/6/2017          NaN        7.0    NaN
4  1/7/2017         32.0        NaN   Rain

In [30]:
weather_data_nan_df.isnull().sum()

day            0
temperature    4
windspeed      6
event          2
dtype: int64

#### set_index() and reset_index() method

In [41]:
weather_df.set_index('day', inplace=True)

In [46]:
weather_df.reset_index(inplace=True)

In [51]:
weather_df.reset_index(drop =True)

          day    temperature     windspeed     event
0    1/1/2017             32             6      Rain
1    1/4/2017  not available             9     Sunny
2    1/5/2017             -1  not measured      Snow
3    1/6/2017  not available             7  no event
4    1/7/2017             32  not measured      Rain
5    1/8/2017  not available  not measured     Sunny
6    1/9/2017  not available  not measured  no event
7   1/10/2017             34             8    Cloudy
8   1/11/2017             -4            -1      Snow
9   1/12/2017             26            12     Sunny
10  1/13/2017             12            12     Rainy
11  1/11/2017             -1            12      Snow
12  1/14/2017             40            -1     Sunny

In [52]:
weather_df

          day    temperature     windspeed     event
0    1/1/2017             32             6      Rain
1    1/4/2017  not available             9     Sunny
2    1/5/2017             -1  not measured      Snow
3    1/6/2017  not available             7  no event
4    1/7/2017             32  not measured      Rain
5    1/8/2017  not available  not measured     Sunny
6    1/9/2017  not available  not measured  no event
7   1/10/2017             34             8    Cloudy
8   1/11/2017             -4            -1      Snow
9   1/12/2017             26            12     Sunny
10  1/13/2017             12            12     Rainy
11  1/11/2017             -1            12      Snow
12  1/14/2017             40            -1     Sunny

#### Selecting a column from a pandas DataFrame

<li>Since our axis in pandas have labels, we can select data using those labels.</li> 
<li>Unlike in NumPy, we donot need to know the exact index location of a pandas dataframe.</li>
<li>To do this, we can use the DataFrame.loc[] attribute. The syntax for DataFrame.loc[] is:</li>
<code>
df.loc[row_label, column_label]
</code>

<li>We can use the following shortcut to select a single column:</li>
<code>
df["column_name"]
</code>

<li>This style of selecting columns is very common.</li>

In [53]:
df["selling_price"]

0        60000
1       135000
2       600000
3       250000
4       450000
         ...
4335    409999
4336    409999
4337    110000
4338    865000
4339    225000
Name: selling_price, Length: 4340, dtype: int64

In [55]:
df.loc[:5,"name"]

0               Maruti 800 AC
1    Maruti Wagon R LXI Minor
2        Hyundai Verna 1.6 SX
3      Datsun RediGO T Option
4       Honda Amaze VX i-DTEC
5        Maruti Alto LX BSIII
Name: name, dtype: object

In [56]:
type(df.loc[:5,"name"])

pandas.core.series.Series

In [57]:
type(df)

pandas.core.frame.DataFrame

#### Pandas Series
<li>Series is the pandas type for one-dimensional objects.</li>
<li>Anytime you see a 1D pandas object, it will be a series. Anytime you see a 2D pandas object, it will be a dataframe.</li>
<li>A dataframe is a collection of series objects, which is similar to how pandas stores the data behind the scenes.</li>

#### Adding a column in a pandas dataframe

In [61]:
df['sp_per_km_driven'] = df['selling_price'] / df['km_driven']

In [62]:
df.shape

(4340, 9)

In [63]:
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner,sp_per_km_driven
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner,0.857143
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner,2.700000
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner,6.000000
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner,5.434783
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner,3.191489

In [64]:
df['dummy_col'] = 0

In [65]:
df

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner,sp_per_km_driven,dummy_col
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner,0.857143,0
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner,2.700000,0
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner,6.000000,0
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner,5.434783,0
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner,3.191489,0
...,...,...,...,...,...,...,...,...,...,...
4335,Hyundai i20 Magna 1.4 CRDi (Diesel),2014,409999,80000,Diesel,Individual,Manual,Second Owner,5.124987,0
4336,Hyundai i20 Magna 1.4 CRDi,2014,409999,80000,Diesel,Individual,Manual,Second Owner,5.124987,0
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual,Second Owner,1.325301,0
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual,First Owner,9.611111,0
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual,First Owner,5.625000,0

### Selecting Multiple Columns From the DataFrame

![](images/selecting_columns.png)

<li>We can select multiple columns from the dataframe by using the following codes:</li>
<code>
    df.loc[:, ["col1", "col2"]]
</code>

<li>We can use syntax shortcuts for selecting multiple columns by using the following syntax:</li>
<code>
    df[["col1", "col2"]]
</code>

In [68]:
weather_nan = pd.read_csv('weather_data_nan.csv',parse_dates=['day'])
weather_nan.head()

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-04          NaN        9.0  Sunny
2 2017-01-05         -1.0        NaN   Snow
3 2017-01-06          NaN        7.0    NaN
4 2017-01-07         32.0        NaN   Rain

In [70]:
weather_nan.set_index('day', inplace=True)

In [71]:
weather_nan.head()

            temperature  windspeed  event
day
2017-01-01         32.0        6.0   Rain
2017-01-04          NaN        9.0  Sunny
2017-01-05         -1.0        NaN   Snow
2017-01-06          NaN        7.0    NaN
2017-01-07         32.0        NaN   Rain

In [74]:
weather_nan[["temperature", "event"]].head()

            temperature  event
day
2017-01-01         32.0   Rain
2017-01-04          NaN  Sunny
2017-01-05         -1.0   Snow
2017-01-06          NaN    NaN
2017-01-07         32.0   Rain

#### Question:
<li>Read 'car_details.csv' file and create a pandas dataframe from it.</li>
<li>Then only select <b>'name'</b>, <b>'selling price'</b> and <b>'km_driven'</b> columns from the dataframe.</li>

![](images/selecting_3_cols.png)

In [77]:
df.loc[:5,['name','selling_price','km_driven']]

                       name  selling_price  km_driven
0             Maruti 800 AC          60000      70000
1  Maruti Wagon R LXI Minor         135000      50000
2      Hyundai Verna 1.6 SX         600000     100000
3    Datsun RediGO T Option         250000      46000
4     Honda Amaze VX i-DTEC         450000     141000
5      Maruti Alto LX BSIII         140000     125000

In [79]:
df.drop('sp_per_km_driven',axis=1, inplace=True)

In [81]:
df.drop('dummy_col',axis=1, inplace=True)

In [82]:
df

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner
...,...,...,...,...,...,...,...,...
4335,Hyundai i20 Magna 1.4 CRDi (Diesel),2014,409999,80000,Diesel,Individual,Manual,Second Owner
4336,Hyundai i20 Magna 1.4 CRDi,2014,409999,80000,Diesel,Individual,Manual,Second Owner
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual,Second Owner
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual,First Owner
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual,First Owner

#### Selecting Rows From A Pandas DataFrame

<li>Now that we've learned how to select columns by label, let's learn how to select rows using the labels of the index axis.</li>
<li>We can use the same syntax to select rows from a dataframe as we do for columns:</li>
<code>
    df.loc[row_label, column_label]
</code>

In [1]:
import pandas as pd

In [4]:
weather_df = pd.read_csv('weather_data_nan.csv', parse_dates = ['day'])
weather_df.shape

(13, 4)

In [6]:
weather_df.set_index('day', inplace=True)

In [8]:
weather_df.loc[['2017-01-01', '2017-01-04']]

            temperature  windspeed  event
day
2017-01-01         32.0        6.0   Rain
2017-01-04          NaN        9.0  Sunny

### Selecting Multiple Rows From the DataFrame

![](images/selecting_multiple_rows.png)

In [9]:
car_df = pd.read_csv('car_details.csv')
car_df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [10]:
car_df.loc[[2,3], ['name', 'fuel', 'seller_type']]

                     name    fuel seller_type
2    Hyundai Verna 1.6 SX  Diesel  Individual
3  Datsun RediGO T Option  Petrol  Individual

#### Indexing & Slicing In Pandas DataFrame

<li>We can slice a dataset from their rows as well as columns.</li>
<li>If we have (5,5) shape data and we want first three rows and first three columns then we need to slice both rows and columns to get a desired shape.</li>
<li>We have df.iloc() method which we can use to do indexing as well as slicing in a dataframe.</li>
<li>Let's practice .iloc() method.</li>

In [11]:
car_df

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner
...,...,...,...,...,...,...,...,...
4335,Hyundai i20 Magna 1.4 CRDi (Diesel),2014,409999,80000,Diesel,Individual,Manual,Second Owner
4336,Hyundai i20 Magna 1.4 CRDi,2014,409999,80000,Diesel,Individual,Manual,Second Owner
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual,Second Owner
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual,First Owner
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual,First Owner

#### Datatype Conversion In Pandas

<li>Pandas astype() is the one of the most important methods. It is used to change data type of a series.</li>
<li>When a pandas dataframe is created from a csv file,the data type is set automatically.</li>
<li>The datatype will not be what it actually should be at times and this is where we can use astype()  to get desired datatype.</li>
<li>For example, a salary column could be imported as string but to do operations we have to convert it into float.</li>
<li>astype() is used to do such data type conversions.</li>

In [12]:
car_df.iloc[45:50,2:6]

    selling_price  km_driven    fuel seller_type
45         625000      40000  Diesel  Individual
46        1050000      50000  Diesel  Individual
47         560000      74000  Diesel  Individual
48         290000      64000  Petrol  Individual
49         275000      60000  Petrol  Individual

### info() method

In [13]:
car_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4340 entries, 0 to 4339
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           4340 non-null   object
 1   year           4340 non-null   int64
 2   selling_price  4340 non-null   int64
 3   km_driven      4340 non-null   int64
 4   fuel           4340 non-null   object
 5   seller_type    4340 non-null   object
 6   transmission   4340 non-null   object
 7   owner          4340 non-null   object
dtypes: int64(3), object(5)
memory usage: 271.4+ KB

#### Value Counts Method

<li>Since series and dataframes are two distinct objects, they have their own unique methods.</li>

<li>Let's look at an example of a series method - the Series.value_counts() method.</li>

<li>This method displays each unique non-null value in a column and their counts in order.</li>

<li>value_counts() is a series only method, we get the following error if we try to use it for dataframes:</li>

In [15]:
car_df['name'].value_counts()

Maruti Swift Dzire VDI                     69
Maruti Alto 800 LXI                        59
Maruti Alto LXi                            47
Maruti Alto LX                             35
Hyundai EON Era Plus                       35
                                           ..
Hyundai Verna Transform CRDi VGT SX ABS     1
Maruti S-Presso VXI Plus                    1
Toyota Etios Liva 1.2 VX                    1
Toyota Yaris G                              1
Hyundai i20 Magna 1.4 CRDi                  1
Name: name, Length: 1491, dtype: int64

In [17]:
car_df['fuel'].value_counts()

Diesel      2153
Petrol      2123
CNG           40
LPG           23
Electric       1
Name: fuel, dtype: int64

#### Vecotrized Operations In Pandas

<li>We'll explore how pandas uses many of the concepts we learned in the NumPy.</li>
<li>Because pandas is designed to operate like NumPy, a lot of concepts and methods from Numpy are supported.</li>
<li>Recall that one of the ways NumPy makes working with data easier is with vectorized operations.</li>
<li>Just like with NumPy, we can use any of the standard Python numeric operators with series, including:</li>
<code>
    series_a + series_b - Addition
    series_a - series_b - Subtraction
    series_a * series_b - Multiplication
    series_a / series_b - Division
</code>

In [19]:
car_df['present_year'] = 2023

In [21]:
car_df['car_age'] = car_df['present_year'] - car_df['year']

In [25]:
weather_df = pd.read_csv('weather_data.csv', skiprows=2)
weather_df

          day    temperature     windspeed     event
0    1/1/2017             32             6      Rain
1    1/4/2017  not available             9     Sunny
2    1/5/2017             -1  not measured      Snow
3    1/6/2017  not available             7  no event
4    1/7/2017             32  not measured      Rain
5    1/8/2017  not available  not measured     Sunny
6    1/9/2017  not available  not measured  no event
7   1/10/2017             34             8    Cloudy
8   1/11/2017             -4            -1      Snow
9   1/12/2017             26            12     Sunny
10  1/13/2017             12            12     Rainy
11  1/11/2017             -1            12      Snow
12  1/14/2017             40            -1     Sunny

In [27]:
weather_df.loc[weather_df['temperature']=='not available']

        day    temperature     windspeed     event
1  1/4/2017  not available             9     Sunny
3  1/6/2017  not available             7  no event
5  1/8/2017  not available  not measured     Sunny
6  1/9/2017  not available  not measured  no event

In [29]:
weather_df.loc[weather_df['windspeed']=='not measured', ["windspeed", "event"]]

      windspeed     event
2  not measured      Snow
4  not measured      Rain
5  not measured     Sunny
6  not measured  no event

In [31]:
weather_df.loc[(weather_df['windspeed']=='not measured') &
               (weather_df['temperature']=='not available')
              ]

        day    temperature     windspeed     event
5  1/8/2017  not available  not measured     Sunny
6  1/9/2017  not available  not measured  no event

In [36]:
weather_df.loc[weather_df['temperature'] == 'not available', 'temperature'] = 0

In [41]:
weather_df['temperature'] = weather_df['temperature'].astype('int64')

In [42]:
weather_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          13 non-null     object
 1   temperature  13 non-null     int64
 2   windspeed    13 non-null     object
 3   event        13 non-null     object
dtypes: int64(1), object(3)
memory usage: 544.0+ bytes

In [43]:
weather_df['temperature_in_kelvin'] = weather_df['temperature'] + 273

In [44]:
weather_df

          day  temperature     windspeed     event  temperature_in_kelvin
0    1/1/2017           32             6      Rain                    305
1    1/4/2017            0             9     Sunny                    273
2    1/5/2017           -1  not measured      Snow                    272
3    1/6/2017            0             7  no event                    273
4    1/7/2017           32  not measured      Rain                    305
5    1/8/2017            0  not measured     Sunny                    273
6    1/9/2017            0  not measured  no event                    273
7   1/10/2017           34             8    Cloudy                    307
8   1/11/2017           -4            -1      Snow                    269
9   1/12/2017           26            12     Sunny                    299
10  1/13/2017           12            12     Rainy                    285
11  1/11/2017           -1            12      Snow                    272
12  1/14/2017           40            -1     Sunny                    313

#### Some Statistical Functions In Pandas

<li>Like NumPy, Pandas supports many descriptive stats methods such as mean, median, mode, min, max and so on.</li>
<li>Here are a few of the most useful ones.</li>
<code>
Series.max()
Series.min()
Series.mean()
Series.median()
Series.mode()
Series.sum()
</code>
<li>We can calculate the average value of a particular column(series) using df.column_name.mean().</li>
<li>For calculating the minimum value in a particular column(series), we can use df.column_name.min().</li>
<li>Similarly, for calculating the maximum value in a particular column(series), we can use df.column_name.max().</li>

In [48]:
car_df.loc[car_df['name']== "Maruti 800 AC", "selling_price"].mean()

94347.82608695653

### What is the maximum selling price of car which is driven by Petrol?

In [51]:
car_df.loc[car_df['fuel']=="Petrol", "selling_price"].max()

8900000

In [55]:
car_df['owner'].mode()

0    First Owner
Name: owner, dtype: object

In [57]:
car_df.loc[car_df['owner']=="First Owner", "km_driven"].min()

1000

### Which is the most expensive car driven by Petrol?

In [52]:
car_df.loc[(car_df['fuel']=="Petrol") &
          (car_df['selling_price'] == 8900000),
          "name"]

3872    Audi RS7 2015-2019 Sportback Performance
Name: name, dtype: object

#### Finding the descriptive statistics of the dataframe using .describe() method

<li>Descriptive statistics include those that summarize the central tendency, dispersion and shape of a dataset's distribution, excluding NaN values.</li>
<li>describe() method in Pandas is used to compute descriptive statistics for all of your numeric columns.</li>
<li>Analyzes both numeric and object series, as well as DataFrame column sets of mixed data types.</li>
<li>The output will vary depending on what is provided.</li>
<li>If we want to see the descriptive statistics of an object datatype then we have to specify <b>df.describe(include = "O")</b></li>

In [58]:
car_df.describe()

              year  selling_price      km_driven  present_year      car_age
count  4340.000000   4.340000e+03    4340.000000        4340.0  4340.000000
mean   2013.090783   5.041273e+05   66215.777419        2023.0     9.909217
std       4.215344   5.785487e+05   46644.102194           0.0     4.215344
min    1992.000000   2.000000e+04       1.000000        2023.0     3.000000
25%    2011.000000   2.087498e+05   35000.000000        2023.0     7.000000
50%    2014.000000   3.500000e+05   60000.000000        2023.0     9.000000
75%    2016.000000   6.000000e+05   90000.000000        2023.0    12.000000
max    2020.000000   8.900000e+06  806599.000000        2023.0    31.000000

#### Assigning Values With Pandas

<li>Just like in NumPy, the same techniques that we use to select data could be used for assignment.</li>

<li>When we selected a whole column by label and used assignment, we assigned the value to every item in that column.</li>

<li>By providing labels for both axes, we can assign them to a single value within our dataframe.</li>

<code>
    df.loc[row_label, col_label] = assignment_value
</code>

In [62]:
weather_df.loc[weather_df['windspeed']=="not measured"
              ,'windspeed'] = 0

In [63]:
weather_df

          day  temperature windspeed     event  temperature_in_kelvin
0    1/1/2017           32         6      Rain                    305
1    1/4/2017            0         9     Sunny                    273
2    1/5/2017           -1         0      Snow                    272
3    1/6/2017            0         7  no event                    273
4    1/7/2017           32         0      Rain                    305
5    1/8/2017            0         0     Sunny                    273
6    1/9/2017            0         0  no event                    273
7   1/10/2017           34         8    Cloudy                    307
8   1/11/2017           -4        -1      Snow                    269
9   1/12/2017           26        12     Sunny                    299
10  1/13/2017           12        12     Rainy                    285
11  1/11/2017           -1        12      Snow                    272
12  1/14/2017           40        -1     Sunny                    313

#### Using Boolean Indexing With Pandas Objects (Selection With Condition In Pandas)
<li>We can assign a value by using row label and column label in pandas.</li>
<li>But what if we need to assign a same value to a group of similar rows with the same criteria.</li>
<li> Instead, we can use boolean indexing to change all rows that meet the same criteria, just like we did with NumPy.</li>


<ol>
    <li>Equals: df['series'] == value</li>
    <li>Not Equals: df['series'] != value</li>
    <li>Less than: df['series'] < value</li>
    <li>Less than or equal to: df['series'] <= value</li>
    <li>Greater than: df['series'] > value</li>
    <li>Greater than or equal to: df['series'] >= value</li>
</ol>
<li>These conditions can be used in several ways, most commonly inside .loc to select values with conditions.</li>

In [64]:
weather_df

          day  temperature windspeed     event  temperature_in_kelvin
0    1/1/2017           32         6      Rain                    305
1    1/4/2017            0         9     Sunny                    273
2    1/5/2017           -1         0      Snow                    272
3    1/6/2017            0         7  no event                    273
4    1/7/2017           32         0      Rain                    305
5    1/8/2017            0         0     Sunny                    273
6    1/9/2017            0         0  no event                    273
7   1/10/2017           34         8    Cloudy                    307
8   1/11/2017           -4        -1      Snow                    269
9   1/12/2017           26        12     Sunny                    299
10  1/13/2017           12        12     Rainy                    285
11  1/11/2017           -1        12      Snow                    272
12  1/14/2017           40        -1     Sunny                    313

In [68]:
weather_df[weather_df['temperature']>30]

          day  temperature windspeed   event  temperature_in_kelvin
0    1/1/2017           32         6    Rain                    305
4    1/7/2017           32         0    Rain                    305
7   1/10/2017           34         8  Cloudy                    307
12  1/14/2017           40        -1   Sunny                    313

In [70]:
weather_df[weather_df['temperature'] < 0]

          day  temperature windspeed event  temperature_in_kelvin
2    1/5/2017           -1         0  Snow                    272
8   1/11/2017           -4        -1  Snow                    269
11  1/11/2017           -1        12  Snow                    272

In [72]:
weather_df[weather_df['temperature']!=0]

          day  temperature windspeed   event  temperature_in_kelvin
0    1/1/2017           32         6    Rain                    305
2    1/5/2017           -1         0    Snow                    272
4    1/7/2017           32         0    Rain                    305
7   1/10/2017           34         8  Cloudy                    307
8   1/11/2017           -4        -1    Snow                    269
9   1/12/2017           26        12   Sunny                    299
10  1/13/2017           12        12   Rainy                    285
11  1/11/2017           -1        12    Snow                    272
12  1/14/2017           40        -1   Sunny                    313

### Using Pandas Method To Create a Boolean Mask

<li>In the last couple lessons, we used Python boolean operators to create boolean masks to select subsets of data.</li>
    
<li>There are also a number of pandas methods that return boolean masks useful for exploring data.</li>

<li>Two examples are the Series.isnull() method and Series.notnull() method.</li>
<li>Series.isnull() method can be used to select either rows that contain null (or NaN) values for a certain column.</li>
<li>Similarly, Series.notnull() method is used to select rows that do not contain null values for a certain column.</li>

In [2]:
import pandas as pd

In [3]:
weather_df = pd.read_csv('weather_data_nan.csv')
weather_df.head()

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/4/2017          NaN        9.0  Sunny
2  1/5/2017         -1.0        NaN   Snow
3  1/6/2017          NaN        7.0    NaN
4  1/7/2017         32.0        NaN   Rain

### Checking null values in temperature columns

In [12]:
weather_df.loc[weather_df['temperature'].isnull(), 'temperature'] = weather_df['temperature'].mean()

In [14]:
weather_df[weather_df['temperature'].isnull()]

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [15]:
weather_df

          day  temperature  windspeed   event
0    1/1/2017    32.000000        6.0    Rain
1    1/4/2017    18.888889        9.0   Sunny
2    1/5/2017    -1.000000        NaN    Snow
3    1/6/2017    18.888889        7.0     NaN
4    1/7/2017    32.000000        NaN    Rain
5    1/8/2017    18.888889        NaN   Sunny
6    1/9/2017    18.888889        NaN     NaN
7   1/10/2017    34.000000        8.0  Cloudy
8   1/11/2017    -4.000000        NaN    Snow
9   1/12/2017    26.000000       12.0   Sunny
10  1/13/2017    12.000000       12.0   Rainy
11  1/11/2017    -1.000000       12.0    Snow
12  1/14/2017    40.000000        NaN   Sunny

In [22]:
weather_df['event'].mode()[0]

'Sunny'

In [23]:
weather_df.loc[weather_df['event'].isnull(), "event"] = weather_df['event'].mode()[0]

In [24]:
weather_df

          day  temperature  windspeed   event
0    1/1/2017    32.000000        6.0    Rain
1    1/4/2017    18.888889        9.0   Sunny
2    1/5/2017    -1.000000        NaN    Snow
3    1/6/2017    18.888889        7.0   Sunny
4    1/7/2017    32.000000        NaN    Rain
5    1/8/2017    18.888889        NaN   Sunny
6    1/9/2017    18.888889        NaN   Sunny
7   1/10/2017    34.000000        8.0  Cloudy
8   1/11/2017    -4.000000        NaN    Snow
9   1/12/2017    26.000000       12.0   Sunny
10  1/13/2017    12.000000       12.0   Rainy
11  1/11/2017    -1.000000       12.0    Snow
12  1/14/2017    40.000000        NaN   Sunny

#### Sorting Values
<li>We can use the DataFrame.sort_values() method to sort the rows on a particular column.</li>
<li>To do so, we pass the column name to the method:</li>
<code>
sorted_rows = df.sort_values("column_name")
</code>
<li>By default, the sort_values() method will sort the rows in ascending order — from smallest to largest.</li>
<li>To sort the rows in descending order instead, we can set the ascending parameter to False:</li>
<code>
    sorted_rows = df.sort_values("column_name", ascending=False)
</code>

In [27]:
weather_df.sort_values("temperature",ascending=False).reset_index(drop=True)

          day  temperature  windspeed   event
0   1/14/2017    40.000000        NaN   Sunny
1   1/10/2017    34.000000        8.0  Cloudy
2    1/1/2017    32.000000        6.0    Rain
3    1/7/2017    32.000000        NaN    Rain
4   1/12/2017    26.000000       12.0   Sunny
5    1/4/2017    18.888889        9.0   Sunny
6    1/6/2017    18.888889        7.0   Sunny
7    1/8/2017    18.888889        NaN   Sunny
8    1/9/2017    18.888889        NaN   Sunny
9   1/13/2017    12.000000       12.0   Rainy
10   1/5/2017    -1.000000        NaN    Snow
11  1/11/2017    -1.000000       12.0    Snow
12  1/11/2017    -4.000000        NaN    Snow

In [29]:
weather_df.sort_values('event', ascending=True).reset_index(drop=True)

          day  temperature  windspeed   event
0   1/10/2017    34.000000        8.0  Cloudy
1    1/1/2017    32.000000        6.0    Rain
2    1/7/2017    32.000000        NaN    Rain
3   1/13/2017    12.000000       12.0   Rainy
4    1/5/2017    -1.000000        NaN    Snow
5   1/11/2017    -4.000000        NaN    Snow
6   1/11/2017    -1.000000       12.0    Snow
7    1/4/2017    18.888889        9.0   Sunny
8    1/6/2017    18.888889        7.0   Sunny
9    1/8/2017    18.888889        NaN   Sunny
10   1/9/2017    18.888889        NaN   Sunny
11  1/12/2017    26.000000       12.0   Sunny
12  1/14/2017    40.000000        NaN   Sunny

### String Manipulation In Pandas DataFrame

<li>String manipulation is the process of changing, parsing, splitting, 'cleaning' or analyzing strings.</li>
<li>As we know that sometimes, data in the string is not suitable for manipulating the analysis or get a description of the data.</li>
<li>But Python is known for its ability to manipulate strings.</li>
<li>Pandas provides us the ways to manipulate to modify and process string data-frame using some builtin functions.</li>
<li>Some of the most useful pandas string processing functions are as follows:</li>
<ol>
    <li><b>lower()</b></li>
    <li><b>upper()</b></li>
    <li><b>strip()</b></li>
    <li><b>split()</b></li>
    <li><b>get_dummies()</b></li>
    <li><b>startswith()</b></li>
    <li><b>endswith()</b></li>
    <li><b>replace()</b></li>
    <li><b>contains()</b></li>
</ol>

In [33]:
weather_df['event'].str.lower()

0       rain
1      sunny
2       snow
3      sunny
4       rain
5      sunny
6      sunny
7     cloudy
8       snow
9      sunny
10     rainy
11      snow
12     sunny
Name: event, dtype: object

In [34]:
weather_df['event'].str.upper()

0       RAIN
1      SUNNY
2       SNOW
3      SUNNY
4       RAIN
5      SUNNY
6      SUNNY
7     CLOUDY
8       SNOW
9      SUNNY
10     RAINY
11      SNOW
12     SUNNY
Name: event, dtype: object

In [37]:
weather_data_nan= pd.read_csv('weather_data_nan.csv')
weather_data_nan.head()

        day  temperature  windspeed   event
0  1/1/2017         32.0        6.0    Rain
1  1/4/2017          NaN        9.0   Sunny
2  1/5/2017         -1.0        NaN    Snow
3  1/6/2017          NaN        7.0     NaN
4  1/7/2017         32.0        NaN    Rain

In [38]:
weather_data_nan['event'].value_counts()

Sunny     3
Snow      2
 Rain     1
 Sunny    1
Rain      1
Cloudy    1
Rainy     1
Snow      1
Name: event, dtype: int64

In [40]:
weather_data_nan['event'] = weather_data_nan['event'].str.strip()

In [41]:
weather_data_nan['event'].value_counts()

Sunny     4
Snow      3
Rain      2
Cloudy    1
Rainy     1
Name: event, dtype: int64

### String Split

In [51]:
weather_data_nan['year'] = weather_data_nan['day'].str.split('/').str[2]

In [53]:
weather_data_nan['month'] = weather_data_nan['day'].str.split('/').str[0]

In [55]:
weather_data_nan['day'] = weather_data_nan['day'].str.split('/').str[1]

In [61]:
pd.get_dummies(weather_df['event'])

    Cloudy  Rain  Rainy  Snow  Sunny
0        0     1      0     0      0
1        0     0      0     0      1
2        0     0      0     1      0
3        0     0      0     0      1
4        0     1      0     0      0
5        0     0      0     0      1
6        0     0      0     0      1
7        1     0      0     0      0
8        0     0      0     1      0
9        0     0      0     0      1
10       0     0      1     0      0
11       0     0      0     1      0
12       0     0      0     0      1

In [58]:
weather_data_nan

   day  temperature  windspeed   event  year month
0    1         32.0        6.0    Rain  2017     1
1    4          NaN        9.0   Sunny  2017     1
2    5         -1.0        NaN    Snow  2017     1
3    6          NaN        7.0     NaN  2017     1
4    7         32.0        NaN    Rain  2017     1
5    8          NaN        NaN   Sunny  2017     1
6    9          NaN        NaN     NaN  2017     1
7   10         34.0        8.0  Cloudy  2017     1
8   11         -4.0        NaN    Snow  2017     1
9   12         26.0       12.0   Sunny  2017     1
10  13         12.0       12.0   Rainy  2017     1
11  11         -1.0       12.0    Snow  2017     1
12  14         40.0        NaN   Sunny  2017     1

In [62]:
car_df = pd.read_csv('car_details.csv')
car_df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [65]:
car_df[car_df['name'].str.startswith('Maruti')]

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
5,Maruti Alto LX BSIII,2007,140000,125000,Petrol,Individual,Manual,First Owner
9,Maruti Celerio Green VXI,2017,365000,78000,CNG,Individual,Manual,First Owner
13,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
...,...,...,...,...,...,...,...,...
4323,Maruti 800 AC,2014,195000,75000,Petrol,Individual,Manual,Second Owner
4324,Maruti Alto 800 Base,2015,155000,40000,Petrol,Individual,Manual,First Owner
4325,Maruti Alto LXi,2000,65000,90000,Petrol,Individual,Manual,Second Owner
4333,Maruti Ritz VDi,2012,225000,90000,Diesel,Individual,Manual,Second Owner
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual,Second Owner

In [68]:
car_df[car_df['name'].str.endswith('AC')]

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
13,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
175,Maruti 800 AC,2007,95000,100000,Petrol,Individual,Manual,Second Owner
259,Maruti 800 AC,2002,65000,100000,Petrol,Individual,Manual,Second Owner
372,Maruti 800 AC,2000,60000,40000,Petrol,Individual,Manual,Third Owner
402,Maruti 800 AC,2007,105000,60000,Petrol,Individual,Manual,Second Owner
669,Maruti 800 AC,2012,180000,120000,Petrol,Individual,Manual,First Owner
1284,Maruti 800 AC,2002,65000,100000,Petrol,Individual,Manual,Second Owner
1446,Maruti 800 AC,2002,80000,70000,Petrol,Individual,Manual,Second Owner
1726,Maruti 800 AC,2009,125000,50000,Petrol,Individual,Manual,Fourth & Above Owner
2386,Maruti Eeco Smiles 5 Seater AC,2014,325000,30000,Petrol,Dealer,Manual,First Owner
3181,Maruti 800 AC,2013,100000,80000,Petrol,Individual,Manual,First Owner
3215,Maruti 800 AC,2004,40000,69111,Petrol,Individual,Manual,Third Owner
3217,Maruti 800 AC,2007,80000,120000,Petrol,Individual,Manual,First Owner
3259,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
3285,Maruti 800 AC,2014,225000,35000,Petrol,Individual,Manual,First Owner
3314,Maruti 800 AC,2008,90000,70000,Petrol,Individual,Manual,Third Owner
3377,Maruti Eeco Smiles 5 Seater AC,2016,330000,72500,Petrol,Dealer,Manual,First Owner
3378,Maruti Eeco Smiles 5 Seater AC,2013,280000,76600,Petrol,Dealer,Manual,First Owner
3503,Maruti 800 AC,2002,80000,40000,Petrol,Individual,Manual,Fourth & Above Owner
3630,Maruti 800 AC,2006,100000,54000,Petrol,Individual,Manual,First Owner
3652,Maruti 800 AC,2008,80000,50000,Petrol,Individual,Manual,Second Owner
3740,Maruti 800 AC,2006,55000,70000,Petrol,Individual,Manual,Second Owner
3856,Maruti 800 AC,1999,50000,100000,Petrol,Individual,Manual,Second Owner
3912,Ambassador CLASSIC 1500 DSL AC,2005,120000,50000,Diesel,Individual,Manual,Second Owner
4016,Ambassador CLASSIC 1500 DSL AC,2005,120000,50000,Diesel,Individual,Manual,Second Owner
4060,Mahindra Thar CRDe AC,2014,600000,100000,Diesel,Individual,Manual,Second Owner
4088,Maruti 800 AC,2009,120000,250000,Petrol,Individual,Manual,Second Owner
4323,Maruti 800 AC,2014,195000,75000,Petrol,Individual,Manual,Second Owner

In [70]:
car_df[car_df['name'].str.contains('CLASSIC')]

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
3912,Ambassador CLASSIC 1500 DSL AC,2005,120000,50000,Diesel,Individual,Manual,Second Owner
4016,Ambassador CLASSIC 1500 DSL AC,2005,120000,50000,Diesel,Individual,Manual,Second Owner

In [73]:
weather_df.replace("Rain", "Rainy")

          day  temperature  windspeed   event
0    1/1/2017    32.000000        6.0   Rainy
1    1/4/2017    18.888889        9.0   Sunny
2    1/5/2017    -1.000000        NaN    Snow
3    1/6/2017    18.888889        7.0   Sunny
4    1/7/2017    32.000000        NaN   Rainy
5    1/8/2017    18.888889        NaN   Sunny
6    1/9/2017    18.888889        NaN   Sunny
7   1/10/2017    34.000000        8.0  Cloudy
8   1/11/2017    -4.000000        NaN    Snow
9   1/12/2017    26.000000       12.0   Sunny
10  1/13/2017    12.000000       12.0   Rainy
11  1/11/2017    -1.000000       12.0    Snow
12  1/14/2017    40.000000        NaN   Sunny

In [75]:
import numpy as np

In [76]:
weather_df.replace({"event": {"Rain": "Rainy"},
                   "windspeed": {np.nan: 0}})

          day  temperature  windspeed   event
0    1/1/2017    32.000000        6.0   Rainy
1    1/4/2017    18.888889        9.0   Sunny
2    1/5/2017    -1.000000        0.0    Snow
3    1/6/2017    18.888889        7.0   Sunny
4    1/7/2017    32.000000        0.0   Rainy
5    1/8/2017    18.888889        0.0   Sunny
6    1/9/2017    18.888889        0.0   Sunny
7   1/10/2017    34.000000        8.0  Cloudy
8   1/11/2017    -4.000000        0.0    Snow
9   1/12/2017    26.000000       12.0   Sunny
10  1/13/2017    12.000000       12.0   Rainy
11  1/11/2017    -1.000000       12.0    Snow
12  1/14/2017    40.000000        0.0   Sunny

#### GroupBy Functions
<li>Pandas groupby is used for grouping the data according to the categories and apply a function to the categories.</li>
<li>It also helps to aggregate data efficiently.</li>
<li>Pandas dataframe.groupby() function is used to split the data into groups based on some criteria.</li>
<code>
    df.groupby(col_name, as_index, sort, dropna)
</code>
<li>It uses split, apply, combine principle to create a groupby dataframe.</li>
<li>The groupby function accepts multiple parameters. Some of them are as follows:</li>
<ol>
    <li>col_name(required): the name of column against which you want to group elements.</li>
    <li>as_index(optional): default = True, if you want to include groupby column as an index set it        to True else False.</li>
    <li>sort(optional): default = True, if you want to sort the group based on keys then keep it as       True else False.</li>
    <li>dropna(optional): default = True, if you keep it as false then it will also include Nan values     as a separate group.</li>
</ol>

### GroupBy Aggregation Functions
<li>Here are some of the aggregating functions available in Pandas and quick summary of what it does.</li>
<ol>
    <li>mean(): Compute mean of groups for numeric columns</li>
    <li>sum(): Compute sum of group values for numeric columns</li>
    <li>size(): Compute group sizes</li>
    <li>count(): Compute count of group</li>
    <li>std(): Standard deviation of groups for numeric columns</li>
    <li>var(): Compute variance of groups for numeric columns</li>
    <li>describe(): Generates descriptive statistics</li>
    <li>first(): Compute first of group values</li>
    <li>last(): Compute last of group values</li>
    <li>nth() : Take nth value, or a subset if n is a list</li>
    <li>min(): Compute min of group values</li>
    <li>max(): Compute max of group values</li>
</ol>

In [82]:
car_df['car_brand'] = car_df['name'].str.split(' ').str[0]

In [84]:
car_df.groupby('car_brand')['selling_price'].mean()

car_brand
Ambassador       1.800000e+05
Audi             1.931633e+06
BMW              2.945385e+06
Chevrolet        2.367271e+05
Daewoo           6.000000e+04
Datsun           2.970269e+05
Fiat             2.834324e+05
Force            3.460000e+05
Ford             5.712731e+05
Honda            5.381468e+05
Hyundai          4.199403e+05
Isuzu            1.500000e+06
Jaguar           2.069166e+06
Jeep             1.530000e+06
Kia              1.300000e+06
Land             3.609800e+06
MG               1.842500e+06
Mahindra         5.877095e+05
Maruti           3.424163e+05
Mercedes-Benz    2.776657e+06
Mitsubishi       8.400000e+05
Nissan           4.499375e+05
OpelCorsa        8.850000e+04
Renault          4.193767e+05
Skoda            4.900147e+05
Tata             2.840834e+05
Toyota           9.243592e+05
Volkswagen       4.710373e+05
Volvo            2.556250e+06
Name: selling_price, dtype: float64

In [85]:
car_df.groupby('car_brand')['selling_price'].max()

car_brand
Ambassador        430000
Audi             8900000
BMW              4950000
Chevrolet        1000000
Daewoo             60000
Datsun            450000
Fiat              890000
Force             346000
Ford             3200000
Honda            1800000
Hyundai          1650000
Isuzu            1500000
Jaguar           2550000
Jeep             1700000
Kia              1300000
Land             4200000
MG               1860000
Mahindra         2700000
Maruti           1100000
Mercedes-Benz    8150000
Mitsubishi       1090000
Nissan           1350000
OpelCorsa         142000
Renault          1000000
Skoda            1200000
Tata             1700000
Toyota           3200000
Volkswagen       1350000
Volvo            4500000
Name: selling_price, dtype: int64

In [86]:
car_df.groupby('car_brand')['selling_price'].min()

car_brand
Ambassador         50000
Audi              650000
BMW               480000
Chevrolet          50000
Daewoo             60000
Datsun            200000
Fiat               55000
Force             346000
Ford               20000
Honda              65000
Hyundai            48000
Isuzu            1500000
Jaguar           1800000
Jeep             1400000
Kia              1300000
Land             2349000
MG               1825000
Mahindra           80000
Maruti             30000
Mercedes-Benz     350000
Mitsubishi        525000
Nissan            138000
OpelCorsa          35000
Renault           200000
Skoda              90000
Tata               35000
Toyota             95000
Volkswagen        130000
Volvo            1750000
Name: selling_price, dtype: int64

In [90]:
car_df.groupby('car_brand')['selling_price'].describe().head()

,count,mean,std,min,25%,50%,75%,max
car_brand,,,,,,,,
Ambassador,4.0,1.800000e+05,1.699019e+05,50000.0,102500.0,120000.0,197500.0,430000.0
Audi,60.0,1.931633e+06,1.236250e+06,650000.0,1300000.0,1580000.0,1850000.0,8900000.0
BMW,39.0,2.945385e+06,1.590511e+06,480000.0,1520000.0,2600000.0,4950000.0,4950000.0
Chevrolet,188.0,2.367271e+05,1.447379e+05,50000.0,150000.0,200000.0,290000.0,1000000.0
Daewoo,1.0,6.000000e+04,NaN,60000.0,60000.0,60000.0,60000.0,60000.0

In [88]:
car_df.groupby('car_brand')['selling_price'].size()

car_brand
Ambassador          4
Audi               60
BMW                39
Chevrolet         188
Daewoo              1
Datsun             37
Fiat               37
Force               1
Ford              238
Honda             252
Hyundai           821
Isuzu               1
Jaguar              6
Jeep                3
Kia                 1
Land                5
MG                  2
Mahindra          365
Maruti           1280
Mercedes-Benz      35
Mitsubishi          6
Nissan             64
OpelCorsa           2
Renault           146
Skoda              68
Tata              361
Toyota            206
Volkswagen        107
Volvo               4
Name: selling_price, dtype: int64

In [93]:
car_df.groupby(['owner', 'car_brand'])['selling_price'].describe()

                        count          mean           std        min  \
owner       car_brand
First Owner Audi         50.0  2.048160e+06  1.313902e+06   850000.0
            BMW          32.0  3.362500e+06  1.435196e+06  1050000.0
            Chevrolet   120.0  2.561083e+05  1.607855e+05    50000.0
            Daewoo        1.0  6.000000e+04           NaN    60000.0
            Datsun       26.0  2.976922e+05  6.510330e+04   200000.0
...                       ...           ...           ...        ...
Third Owner Skoda         7.0  6.257143e+05  5.372727e+05   180000.0
            Tata         30.0  1.315370e+05  8.222710e+04    35000.0
            Toyota       22.0  5.568181e+05  2.718829e+05   220000.0
            Volkswagen    6.0  2.900000e+05  6.442049e+04   175000.0
            Volvo         1.0  1.750000e+06           NaN  1750000.0

                              25%        50%        75%        max
owner       car_brand
First Owner Audi        1300000.0  1580000.0  2393750.0  8900000.0
            BMW         2275000.0  2900000.0  4950000.0  4950000.0
            Chevrolet    160000.0   227499.5   292500.0  1000000.0
            Daewoo        60000.0    60000.0    60000.0    60000.0
            Datsun       250000.0   292500.0   350000.0   434999.0
...                           ...        ...        ...        ...
Third Owner Skoda        195000.0   210000.0  1200000.0  1200000.0
            Tata          75000.0   115000.0   168750.0   430000.0
            Toyota       350000.0   475000.0   701250.0  1200000.0
            Volkswagen   270000.0   310000.0   331250.0   350000.0
            Volvo       1750000.0  1750000.0  1750000.0  1750000.0

[82 rows x 8 columns]

In [96]:
car_df.groupby('owner')['km_driven'].nth(2)

owner
First Owner             100000
Fourth & Above Owner     60000
Second Owner            141000
Test Drive Car             101
Third Owner             120000
Name: km_driven, dtype: int64

####  Concatenating DataFrames
<li>pandas.concat() function does all the heavy lifting of performing concatenation operations along with an axis</li>
<li>If we want to join two individual dataframes and create a combined dataframe out of it, we can use concatenation operation for doing so.</li>
<li>We can use concatenation operation along the rows(axis=0) as well as along the columns(axis = 1)</li>

**syntax**

<code>
    pd.concat([df1,df2], axis, keys, ignore_index)
</code>

<li>df1 and df2 (required) are two dataframes which we want to merge.</li>
<li>axis: axis to concatenate along, (possible values; 0(along the rows) and 1 (along the cols) default = 0 (along the rows).</li>
<li>keys: sequence to add an identifier to the result indexes; default = None</li>
<li>ignore_index: if True, do not use the index values along the concatenation axis; default = False</li>

#### Concatenating Dataframes along the rows

![](images/concat_rows.png)

In [2]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({"Name": ["Prabhat", "Hari", "Shyam", "Sita", "Mahima"],
                   "Age":[24,34,50,32,18],
                   "Address": ["Manigram", "Dhanewa", "Bardaghat", "Manglapur",
                              "Bharatpur"]})
df1.head()

      Name  Age    Address
0  Prabhat   24   Manigram
1     Hari   34    Dhanewa
2    Shyam   50  Bardaghat
3     Sita   32  Manglapur
4   Mahima   18  Bharatpur

In [4]:
df2 = pd.DataFrame({"Name": ["Sunil", "Bhawana", "Shiva", "Himal", "Dipen"],
                   "Age":[23,22,23,25,26],
                   "Address": ["Kathmandu", "Ramechap", "Kalanki", "Chaupatta",
                              "Kritipur"]})
df2.head()

      Name  Age    Address
0    Sunil   23  Kathmandu
1  Bhawana   22   Ramechap
2    Shiva   23    Kalanki
3    Himal   25  Chaupatta
4    Dipen   26   Kritipur

In [5]:
combined_df = pd.concat([df1, df2], axis=0)
combined_df.shape

(10, 3)

In [6]:
print(df1.shape)
print(df2.shape)

(5, 3)
(5, 3)

In [7]:
combined_df

      Name  Age    Address
0  Prabhat   24   Manigram
1     Hari   34    Dhanewa
2    Shyam   50  Bardaghat
3     Sita   32  Manglapur
4   Mahima   18  Bharatpur
0    Sunil   23  Kathmandu
1  Bhawana   22   Ramechap
2    Shiva   23    Kalanki
3    Himal   25  Chaupatta
4    Dipen   26   Kritipur

#### Concatenating DataFrames along columns
![](images/concat_cols.png)

In [8]:
df3 = pd.DataFrame({"Gender": ["Male", "Male", "Male", "Female", "Female",
                              "Male", "Female", "Male", "Male", "Male"], 
                   "Height": [1.6, 1.7, 1.5, 1.6, 1.65, 1.72, 1.43, 1.8, 1.71, 1.42],
                   "Weight": [70, 67, 65, 45, 48, 73, 55, 82, 67, 55]})
df3.head()

   Gender  Height  Weight
0    Male    1.60      70
1    Male    1.70      67
2    Male    1.50      65
3  Female    1.60      45
4  Female    1.65      48

In [15]:
combined_df.reset_index(drop=True, inplace=True)
combined_df

      Name  Age    Address
0  Prabhat   24   Manigram
1     Hari   34    Dhanewa
2    Shyam   50  Bardaghat
3     Sita   32  Manglapur
4   Mahima   18  Bharatpur
5    Sunil   23  Kathmandu
6  Bhawana   22   Ramechap
7    Shiva   23    Kalanki
8    Himal   25  Chaupatta
9    Dipen   26   Kritipur

In [16]:
final_combined_df = pd.concat([combined_df, df3], axis=1)
final_combined_df.head()

      Name  Age    Address  Gender  Height  Weight
0  Prabhat   24   Manigram    Male    1.60      70
1     Hari   34    Dhanewa    Male    1.70      67
2    Shyam   50  Bardaghat    Male    1.50      65
3     Sita   32  Manglapur  Female    1.60      45
4   Mahima   18  Bharatpur  Female    1.65      48

In [17]:
final_combined_df.shape

(10, 6)

In [18]:
train_df = pd.read_csv('csv_data/crop_health/train.csv')
print(train_df.shape)
train_df.head()

(88858, 10)

,ID,Estimated_Insects_Count,Crop_Type,Soil_Type,Pesticide_Use_Category,Number_Doses_Week,Number_Weeks_Used,Number_Weeks_Quit,Season,Crop_Damage
0,F00000001,188,1,0,1,0,0.0,0,1,0
1,F00000003,209,1,0,1,0,0.0,0,2,1
2,F00000004,257,1,0,1,0,0.0,0,2,1
3,F00000005,257,1,1,1,0,0.0,0,2,1
4,F00000006,342,1,0,1,0,0.0,0,2,1

In [19]:
test_df = pd.read_csv('csv_data/crop_health/test.csv')
print(test_df.shape)
test_df.head()

(59310, 9)

,ID,Estimated_Insects_Count,Crop_Type,Soil_Type,Pesticide_Use_Category,Number_Doses_Week,Number_Weeks_Used,Number_Weeks_Quit,Season
0,F00000002,188,1,1,1,0,NaN,0,2
1,F00000007,410,1,1,1,0,0.0,0,2
2,F00000011,626,1,0,1,0,0.0,0,2
3,F00000013,731,1,0,1,0,0.0,0,2
4,F00000014,789,0,0,1,0,0.0,0,1

In [20]:
combined_df = pd.concat([train_df, test_df], axis=0)
print(combined_df.shape)
combined_df.head()

(148168, 10)

,ID,Estimated_Insects_Count,Crop_Type,Soil_Type,Pesticide_Use_Category,Number_Doses_Week,Number_Weeks_Used,Number_Weeks_Quit,Season,Crop_Damage
0,F00000001,188,1,0,1,0,0.0,0,1,0.0
1,F00000003,209,1,0,1,0,0.0,0,2,1.0
2,F00000004,257,1,0,1,0,0.0,0,2,1.0
3,F00000005,257,1,1,1,0,0.0,0,2,1.0
4,F00000006,342,1,0,1,0,0.0,0,2,1.0

#### Merge
<li>Pandas has full-featured, high performance in-memory join operations idiomatically very similar to relational databases like SQL.</li>
<li>Pandas provides a single function, merge, as the entry point for all standard database join operations between DataFrame objects.</li>
<li>The <b>merge()</b> method updates the content of two DataFrame by merging them together, using the specified method(s).</li>
<li>We can use the parameters to control which values to keep and which to replace during merge operation.</li>
<li>We can specify any type of join we want by using how parameter in merge method.</li>
<li>There are four types of join operations. They are :</li>
<ol>
    <b><li>Inner join</li></b>
    <b><li>Left join</li></b>
    <b><li>Right join</li></b>
    <b><li>Outer join</li></b>
</ol>

#### 1. Inner Join
![](images/inner_join.png)

In [24]:
df1 = pd.DataFrame({"name": ['Prabhat', 'Hari', 'Shiva', 'Bhawana', 'Mahima', 'Sunil'],
                  "age": [24,34,50,32,18,23],
                  "address": ["Manigram", "Dhanewa", "Bardaghat", 
                             "Manglapur", "Bharatpur", "Kathmandu"]})
df1.head()

      name  age    address
0  Prabhat   24   Manigram
1     Hari   34    Dhanewa
2    Shiva   50  Bardaghat
3  Bhawana   32  Manglapur
4   Mahima   18  Bharatpur

In [25]:
df2 = pd.DataFrame({"name": ['Prabhat', 'Hari', 'Shyam', 'Sita', 'Mahima', 'Sunil'],
                  "gender": ["male", 'male', 'male','female','female','male'],
                  "height": [1.6,1.7,1.8,1.43,1.65,1.72]})
df2.head()

      name  gender  height
0  Prabhat    male    1.60
1     Hari    male    1.70
2    Shyam    male    1.80
3     Sita  female    1.43
4   Mahima  female    1.65

In [26]:
inner_df = pd.merge(df1, df2, how='inner', on='name')
print(inner_df.shape)
inner_df.head()

(4, 5)

      name  age    address  gender  height
0  Prabhat   24   Manigram    male    1.60
1     Hari   34    Dhanewa    male    1.70
2   Mahima   18  Bharatpur  female    1.65
3    Sunil   23  Kathmandu    male    1.72

#### 2. Left Join

![](images/left_join.png)

In [27]:
left_df = pd.merge(df1, df2, how='left', on='name')
print(left_df.shape)
left_df.head()

(6, 5)

      name  age    address  gender  height
0  Prabhat   24   Manigram    male    1.60
1     Hari   34    Dhanewa    male    1.70
2    Shiva   50  Bardaghat     NaN     NaN
3  Bhawana   32  Manglapur     NaN     NaN
4   Mahima   18  Bharatpur  female    1.65

#### 3. Right Join

![](images/right_join.png)

In [28]:
right_df = pd.merge(df1, df2, how='right', on='name')
print(right_df.shape)
right_df.head()

(6, 5)

      name   age    address  gender  height
0  Prabhat  24.0   Manigram    male    1.60
1     Hari  34.0    Dhanewa    male    1.70
2    Shyam   NaN        NaN    male    1.80
3     Sita   NaN        NaN  female    1.43
4   Mahima  18.0  Bharatpur  female    1.65

#### 4. Outer Join

![](images/outer_join.png)

In [29]:
outer_df = pd.merge(df1,df2,how='outer',on='name')
print(outer_df.shape)
outer_df.head()

(8, 5)

      name   age    address  gender  height
0  Prabhat  24.0   Manigram    male    1.60
1     Hari  34.0    Dhanewa    male    1.70
2    Shiva  50.0  Bardaghat     NaN     NaN
3  Bhawana  32.0  Manglapur     NaN     NaN
4   Mahima  18.0  Bharatpur  female    1.65

#### Crosstab 

<li>Cross tabulation is used to quantitatively analyze the relationship between multiple variables.</li>
<li>Cross tabulations — also referred to as contingency tables or crosstabs.</li>
<li>They group variables together and enable researchers to understand the correlation between different variables.<li>
<li>When we are doing multivariate analysis then we often came across crosstab() methods in pandas.</li>

**Syntax**

<code>
    pd.crosstab(index, columns, values, margins, margin_names, normalize,aggfunc, dropna)
</code>
<ol>
    <li>index : array-like, Series, or list of arrays/Series, Values to group by in the rows.</li>
    <li>columns : array-like, Series, or list of arrays/Series, Values to group by in the columns.</li>
    <li>values : array-like, optional, array of values to aggregate according to the factors. Requires `aggfunc` be specified.     </li>
    <li>aggfunc : function, optional, If specified, requires `values` be specified as well.</li>
    <li>margins : bool, default False, Add row/column margins (subtotals).</li>
    <li>margins_name : str, default ‘All’, Name of the row/column that will contain the totals when margins is True.</li>
    <li>dropna : bool, default True, Do not include columns whose entries are all NaN.</li>
    <li>normalize: </li>
    <ol>
        <li>If passed ‘all’ or True, will normalize over all values.</li>
        <li>If passed ‘index’ will normalize over each row.</li>
        <li>If passed ‘columns’ will normalize over each column.</li>
        <li>If margins is True, will also normalize margin values.</li>
    </ol>
</ol>

In [33]:
ipl_df = pd.read_csv('csv_data/IPL_Matches_2008_2022.csv')
print(ipl_df.shape)

(950, 20)

In [34]:
ipl_df.head()

,ID,City,Date,Season,MatchNumber,Team1,Team2,Venue,TossWinner,TossDecision,SuperOver,WinningTeam,WonBy,Margin,method,Player_of_Match,Team1Players,Team2Players,Umpire1,Umpire2
0,1312200,Ahmedabad,2022-05-29,2022,Final,Rajasthan Royals,Gujarat Titans,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,bat,N,Gujarat Titans,Wickets,7.0,NaN,HH Pandya,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",CB Gaffaney,Nitin Menon
1,1312199,Ahmedabad,2022-05-27,2022,Qualifier 2,Royal Challengers Bangalore,Rajasthan Royals,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,field,N,Rajasthan Royals,Wickets,7.0,NaN,JC Buttler,"['V Kohli', 'F du Plessis', 'RM Patidar', 'GJ ...","['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...",CB Gaffaney,Nitin Menon
2,1312198,Kolkata,2022-05-25,2022,Eliminator,Royal Challengers Bangalore,Lucknow Super Giants,"Eden Gardens, Kolkata",Lucknow Super Giants,field,N,Royal Challengers Bangalore,Runs,14.0,NaN,RM Patidar,"['V Kohli', 'F du Plessis', 'RM Patidar', 'GJ ...","['Q de Kock', 'KL Rahul', 'M Vohra', 'DJ Hooda...",J Madanagopal,MA Gough
3,1312197,Kolkata,2022-05-24,2022,Qualifier 1,Rajasthan Royals,Gujarat Titans,"Eden Gardens, Kolkata",Gujarat Titans,field,N,Gujarat Titans,Wickets,7.0,NaN,DA Miller,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",BNJ Oxenford,VK Sharma
4,1304116,Mumbai,2022-05-22,2022,70,Sunrisers Hyderabad,Punjab Kings,"Wankhede Stadium, Mumbai",Sunrisers Hyderabad,bat,N,Punjab Kings,Wickets,5.0,NaN,Harpreet Brar,"['PK Garg', 'Abhishek Sharma', 'RA Tripathi', ...","['JM Bairstow', 'S Dhawan', 'M Shahrukh Khan',...",AK Chaudhary,NA Patwardhan

In [36]:
pd.crosstab(ipl_df['TossWinner'], ipl_df['WinningTeam'], margins=True)

WinningTeam,Chennai Super Kings,Deccan Chargers,Delhi Capitals,Delhi Daredevils,Gujarat Lions,Gujarat Titans,Kings XI Punjab,Kochi Tuskers Kerala,Kolkata Knight Riders,Lucknow Super Giants,Mumbai Indians,Pune Warriors,Punjab Kings,Rajasthan Royals,Rising Pune Supergiant,Rising Pune Supergiants,Royal Challengers Bangalore,Sunrisers Hyderabad,All
TossWinner,,,,,,,,,,,,,,,,,,,
Chennai Super Kings,68,1,2,4,0,1,5,0,4,0,7,1,2,6,0,0,6,2,109
Deccan Chargers,2,19,0,5,0,0,3,0,3,0,4,1,0,3,0,0,3,0,43
Delhi Capitals,3,0,21,0,0,1,2,0,1,0,3,0,0,1,0,0,2,2,36
Delhi Daredevils,5,0,0,35,1,0,7,0,5,0,9,1,0,7,0,0,5,4,79
Gujarat Lions,0,0,0,0,10,0,2,0,0,0,1,0,0,0,0,0,2,0,15
Gujarat Titans,0,0,0,0,0,7,0,0,0,0,1,0,1,0,0,0,1,0,10
Kings XI Punjab,4,2,1,3,0,0,36,0,8,0,7,2,0,6,0,1,7,8,85
Kochi Tuskers Kerala,0,1,0,0,0,0,0,4,0,0,0,1,0,0,0,0,2,0,8
Kolkata Knight Riders,9,1,2,5,0,0,6,2,64,1,10,1,0,5,0,0,3,5,114
Lucknow Super Giants,0,0,0,0,0,0,0,0,0,4,0,0,0,1,0,0,2,0,7
Mumbai Indians,5,0,2,6,0,0,10,0,4,2,70,1,1,5,2,1,8,6,123
Pune Warriors,3,0,0,2,0,0,1,0,0,0,3,3,0,2,0,0,4,2,20
Punjab Kings,0,0,1,0,0,0,0,0,0,1,0,0,4,2,0,0,0,1,9
Rajasthan Royals,11,1,3,3,0,2,5,0,7,0,6,1,1,49,0,0,4,4,97
Rising Pune Supergiant,0,0,0,1,0,0,0,0,0,0,0,0,0,0,5,0,0,0,6
Rising Pune Supergiants,0,0,0,0,1,0,1,0,1,0,0,0,0,0,0,3,1,0,7
Royal Challengers Bangalore,5,4,1,3,1,1,8,0,7,0,6,0,2,4,2,0,53,7,104
Sunrisers Hyderabad,6,0,3,0,0,0,2,0,10,1,4,0,2,5,1,0,6,34,74
All,121,29,36,67,13,12,88,6,114,9,131,12,13,96,10,5,109,75,946

#### Pivot
<li>pivot() method produces pivot table based on 3 columns of the DataFrame. Uses unique values from index / columns and fills with values.</li>

    
**syntax**
<code>
pd.pivot(index, columns, values)
</code>
    
<b>Parameters:</b>
<ol>
    <li>index[ndarray] : Labels to use to make new frame’s index</li>
    <li>columns[ndarray] : Labels to use to make new frame’s columns</li>
    <li>values[ndarray] : Values to use for populating new frame’s values</li>
</ol>

**Returns: Reshaped DataFrame**

**Exception: ValueError raised if there are any duplicates.**

In [38]:
car_df = pd.read_csv('csv_data/car_details.csv')
car_df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [39]:
car_df['brand'] = car_df['name'].str.split(' ').str[0]

In [50]:
pd.pivot_table(car_df, index = 'owner', columns='brand',values= 'selling_price')

brand,Ambassador,Audi,BMW,Chevrolet,Daewoo,Datsun,Fiat,Force,Ford,Honda,...,Mercedes-Benz,Mitsubishi,Nissan,OpelCorsa,Renault,Skoda,Tata,Toyota,Volkswagen,Volvo
owner,,,,,,,,,,,,,,,,,,,,,
First Owner,NaN,2.048160e+06,3.362500e+06,256108.325000,60000.0,297692.230769,369631.526316,346000.0,705567.347518,604109.91623,...,3.090731e+06,731250.0,481155.511111,NaN,423612.594595,502121.951220,355354.806452,1.117809e+06,5.051449e+05,2825000.0
Fourth & Above Owner,50000.000000,NaN,NaN,250000.000000,NaN,NaN,165000.000000,NaN,183749.750000,310000.00000,...,NaN,NaN,NaN,142000.0,NaN,175000.000000,125000.000000,4.383333e+05,2.300000e+05,NaN
Second Owner,223333.333333,1.348333e+06,1.011667e+06,191145.434783,NaN,295454.454545,191000.000000,NaN,335288.118644,332291.56250,...,1.869333e+06,1057500.0,376117.588235,NaN,406781.218750,430473.684211,192719.560748,6.547090e+05,4.136551e+05,NaN
Test Drive Car,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,958999.769231,932500.00000,...,NaN,NaN,NaN,NaN,541000.000000,NaN,NaN,NaN,1.350000e+06,NaN
Third Owner,NaN,1.350000e+06,1.200000e+06,222578.894737,NaN,NaN,208333.333333,NaN,166380.952381,210300.00000,...,NaN,NaN,375000.000000,35000.0,325000.000000,625714.285714,131537.033333,5.568181e+05,2.900000e+05,1750000.0